{"format": "keras", "nodes": [{"name": "discriminator", "id": "discriminator", "class_name": "Functional", "output_shape": [null, 1], "num_parameters": 6561793}, {"name": "generator", "id": "generator", "class_name": "Functional", "output_shape": [null, 4, 4, 3], "num_parameters": 8661507}], "edges": []}