{"format": "keras", "nodes": [{"name": "decoder", "id": "decoder", "class_name": "Functional", "output_shape": [null, 128, 128, 3], "num_parameters": 1619811}, {"name": "discriminator", "id": "discriminator", "class_name": "Functional", "output_shape": [null, 1], "num_parameters": 2413505}, {"name": "decoder_input", "id": "decoder_input", "class_name": "InputLayer", "output_shape": [[null, 512]], "num_parameters": 0}, {"name": "decoder", "id": "decoder", "class_name": "Functional", "output_shape": [null, 128, 128, 3], "num_parameters": 1619811}, {"name": "sequential_2", "id": "sequential_2", "class_name": "Sequential", "output_shape": [null, 1], "num_parameters": 4033316}], "edges": [["decoder", "discriminator"], ["decoder_input", "decoder"]]}