{"format": "keras", "nodes": [{"name": "image_input", "id": "image_input", "class_name": "InputLayer", "output_shape": [[null, 128, 128, 3]], "num_parameters": 0}, {"name": "encoder", "id": "encoder", "class_name": "Functional", "output_shape": [null, 8, 8, 512], "num_parameters": 6475712}, {"name": "vector_quantizer", "id": "vector_quantizer", "class_name": "VectorQuantizer", "output_shape": [null, 8, 8, 512], "num_parameters": 131072}, {"name": "decoder", "id": "decoder", "class_name": "Functional", "output_shape": [null, 128, 128, 3], "num_parameters": 7523779}, {"name": "vector_quantizer", "id": "vector_quantizer", "class_name": "VectorQuantizer", "output_shape": [null, 8, 8, 512], "num_parameters": 131072}, {"name": "vq_vae", "id": "vq_vae", "class_name": "Functional", "output_shape": [null, 128, 128, 3], "num_parameters": 14130563}], "edges": [["image_input", "encoder"], ["vector_quantizer", "decoder"], ["encoder", "vector_quantizer"]]}